; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-14)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	city0 - city
	city1 - city
	city2 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl1)
	(at plane2 city0)
	(fuel-level plane2 fl2)
	(at plane3 city2)
	(fuel-level plane3 fl4)
	(at plane4 city2)
	(fuel-level plane4 fl0)
	(at person1 city0)
	(at person2 city0)
	(at person3 city0)
	(at person4 city0)
	(at person5 city0)
	(at person6 city2)
	(at person7 city1)
	(at person8 city0)
	(at person9 city2)
	(at person10 city1)
	(at person11 city1)
	(at person12 city1)
	(at person13 city2)
	(at person14 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city1)
	(at plane4 city1)
	(at person1 city2)
	(at person2 city1)
	(at person3 city0)
	(at person4 city1)
	(at person5 city2)
	(at person6 city2)
	(at person7 city0)
	(at person8 city1)
	(at person9 city2)
	(at person10 city0)
	(at person11 city0)
	(at person12 city1)
	(at person13 city1)
	(at person14 city2)
	))

)

; plan
1. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 4 of 16
2. (fly plane4 city2 city1 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 5 of 16
3. (board person7 plane4 city1)
   deleted: (at person7 city1)
   added: (in person7 plane4)
   goals met: 5 of 16
4. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 16
5. (board person14 plane4 city1)
   deleted: (at person14 city1)
   added: (in person14 plane4)
   goals met: 5 of 16
6. (board person11 plane4 city1)
   deleted: (at person11 city1)
   added: (in person11 plane4)
   goals met: 5 of 16
7. (board person10 plane4 city1)
   deleted: (at person10 city1)
   added: (in person10 plane4)
   goals met: 5 of 16
8. (board person13 plane3 city2)
   deleted: (at person13 city2)
   added: (in person13 plane3)
   goals met: 5 of 16
9. (zoom plane3 city2 city1 fl4 fl3 fl2)
   deleted: (at plane3 city2) (fuel-level plane3 fl4)
   added: (at plane3 city1) (fuel-level plane3 fl2)
   goals met: 5 of 16
10. (debark person13 plane3 city1)
   deleted: (in person13 plane3)
   added: (at person13 city1)
   goals met: 6 of 16
11. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 7 of 16
12. (board person8 plane2 city0)
   deleted: (at person8 city0)
   added: (in person8 plane2)
   goals met: 7 of 16
13. (board person5 plane2 city0)
   deleted: (at person5 city0)
   added: (in person5 plane2)
   goals met: 7 of 16
14. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   goals met: 7 of 16
15. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   goals met: 7 of 16
16. (zoom plane2 city0 city1 fl2 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl2)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 7 of 16
17. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 16
18. (debark person8 plane2 city1)
   deleted: (in person8 plane2)
   added: (at person8 city1)
   goals met: 8 of 16
19. (debark person4 plane2 city1)
   deleted: (in person4 plane2)
   added: (at person4 city1)
   goals met: 9 of 16
20. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   goals met: 10 of 16
21. (fly plane2 city1 city2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 10 of 16
22. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   goals met: 11 of 16
23. (fly plane4 city1 city0 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 10 of 16
24. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 10 of 16
25. (debark person7 plane4 city0)
   deleted: (in person7 plane4)
   added: (at person7 city0)
   goals met: 11 of 16
26. (debark person11 plane4 city0)
   deleted: (in person11 plane4)
   added: (at person11 city0)
   goals met: 12 of 16
27. (debark person10 plane4 city0)
   deleted: (in person10 plane4)
   added: (at person10 city0)
   goals met: 13 of 16
28. (board person1 plane4 city0)
   deleted: (at person1 city0)
   added: (in person1 plane4)
   goals met: 13 of 16
29. (fly plane4 city0 city2 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 13 of 16
30. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 16
31. (debark person14 plane4 city2)
   deleted: (in person14 plane4)
   added: (at person14 city2)
   goals met: 14 of 16
32. (debark person1 plane4 city2)
   deleted: (in person1 plane4)
   added: (at person1 city2)
   goals met: 15 of 16
33. (fly plane4 city2 city1 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 16 of 16
